app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= form.label :auther_id, style: "display: block" %>
    <%= form.collection_select :author_id, Author.all, :id, :name, prompt: "Select an Author" %>