app/controllers/authors_controller.rb

  def destroy
    @author.destroy!
---
DELETE FROM "authors" WHERE "authors"."id" = $1  [["id", 20]]