app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "description", "number_of_pages", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Short book"], ["description", "dsfdsfdsf"], ["number_of_pages", 33], ["created_at", "2025-09-05 12:49:37.771848"], ["updated_at", "2025-09-05 12:49:37.771848"], ["author_id", 3]]